backend/app/controllers/api/v1/dashboard_controller.rb

  def authenticate!
    token = request.headers["Authorization"]&.split(" ")&.last
    @api_key = ApiKey.find_by(token: token)
---
SELECT "api_keys".* FROM "api_keys" WHERE "api_keys"."token" = 'undefined' LIMIT 1